list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]

list2 = list1 + [10, 11, 12, 13, 14, 18]

print(list2)
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 18]

list3 = list2[14] = 15

print(list1)
# [1, 2, 3, 4, 5, 6, 7, 8, 9]

print(list1[2])
# 3

print(list3)
# 15

# #########################################################################

tx = ["mai", "dinh", "lua"]
ts = ["thu"]
tt = tx

txs = id(tx) == id(ts)
txt = id(tx) == id(tt)

ts.append("nguye")
ts.copy()

print(txs)
# False

print(txt)
# True

print(ts)
# ['thu', 'nguye']

# #########################################################################

correct_tt = tx[:]
correct_tt[-1] = "luan"

print(correct_tt)
# ['mai', 'dinh', 'luan']

print(tx)
# ['mai', 'dinh', 'lua']

# #########################################################################

listt = ["a", "b", "c", "d", "e", "f", "g", "h"]
print(listt)
# ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']

listt[3:6] = ["D", "E", "F"]
print(listt)
# ['a', 'b', 'c', 'D', 'E', 'F', 'g', 'h']

print( f"số lượng chữ: {len(listt)}")
# số lượng chữ: 8

# #########################################################################

a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
b = ["a", "b", "c", "d","e", "f", "g", "h"]

c = [a, b]

print(c)
# [[1, 2, 3, 4, 5, 6, 7, 8, 9, 10], ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h']]

print(c[0])
# [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(c[1][2])
# c

# #########################################################################

a, b = 0, 1
print(a, b)
# 0 1

while a < 5:
    print(a, end=", ")
    a, b = b, a+b
    # 0, 1, 1, 2, 3,